administrative-service-3/src/main/resources/templates/sanction-details-template.hbs

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="urn://co-opbank.co.ke/CommonServices/Data/Message/MessageHeader" xmlns:com="urn://co-opbank.co.ke/CommonServices/Data/Common" xmlns:ns="urn://co-opbank.co.ke/DataModel/Customer/SanctionDetails/Get/1.0">
   <soapenv:Header>
      <mes:RequestHeader>
         <!--Optional:-->
         <com:CreationTimestamp>{{creationTimestamp}}</com:CreationTimestamp>
         <!--Optional:-->
         <com:CorrelationID>{{correlationId}}</com:CorrelationID>
         <mes:MessageID>{{messageId}}</mes:MessageID>
         <!--Optional:-->
         <mes:Credentials>
            <!--Optional:-->
            <mes:SystemCode>{{systemCode}}</mes:SystemCode>
         </mes:Credentials>
      </mes:RequestHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ns:sanctionDetailsInput>
         <!--Optional:-->
         <ns:OperationParameters>
            <ns:MinMatchScore>{{minMatchScore}}</ns:MinMatchScore>
            <ns:CustomerType>{{customerType}}</ns:CustomerType>
            <ns:FullName>{{fullName}}</ns:FullName>
            <!--Optional:-->
            <ns:FirstName>{{firstName}}</ns:FirstName>
            <!--Optional:-->
            <ns:MiddleName>{{middleName}}</ns:MiddleName>
            <!--Optional:-->
            <ns:LastName>{{lastName}}</ns:LastName>
            <!--Optional:-->
            <ns:IdentificationDocType>{{identificationDocType}}</ns:IdentificationDocType>
            <!--Optional:-->
            <ns:IdentificationDocNo>{{identificationDocNo}}</ns:IdentificationDocNo>
            <!--Optional:-->
            <ns:Nationality>{{nationality}}</ns:Nationality>
            <!--Optional:-->
            <ns:DateOfBirth>{{dateOfBirth}}</ns:DateOfBirth>
            <!--Optional:-->
            <ns:CountryOfBirth>{{countryOfBirth}}</ns:CountryOfBirth>
            <!--Optional:-->
            <ns:AddressDetail>
               <!--Optional:-->
               <ns:City>{{addressCity}}</ns:City>
               <!--Optional:-->
               <ns:StateOrProvince>{{addressProvince}}</ns:StateOrProvince>
               <!--Optional:-->
               <ns:PostalAddress>{{postalAddress}}</ns:PostalAddress>
               <!--Optional:-->
               <ns:ZipCode>?</ns:ZipCode>
               <!--Optional:-->
               <ns:PostalCode>{{postalCodeAddress}}</ns:PostalCode>
               <!--Optional:-->
               <ns:Country>{{addressCountry}}</ns:Country>
            </ns:AddressDetail>
         </ns:OperationParameters>
      </ns:sanctionDetailsInput>
   </soapenv:Body>
</soapenv:Envelope>